README.md
```plantuml
@startuml
group Register a user
    User -> "User Service": POST /register/

    activate "User Service"
        "User Service" -> "Billing Service": POST /account/

        activate "Billing Service"
            "Billing Service" --> "User Service": 201 CREATED {account_id}
        deactivate "Billing Service"

        "User Service" -> User: 201 CREATED
    deactivate "User Service"
end

group Charge a user account
    User -> "Billing Service": POST /transaction/

    activate "Billing Service"
        "Billing Service" --> User: 200 OK
    deactivate "Billing Service"
end

group Create an order
    User -> "Order Service": POST /order/
    activate "Order Service"
        "Order Service" -> "Billing Service": POST /transaction/

        activate "Billing Service"
            "Billing Service" --> "Order Service": 200 OK
        deactivate "Billing Service"

        "Order Service" -> "Message Broker": publish

        "Order Service" --> User: 200 OK
    deactivate "Order Service"

    activate "Message Broker"
        note right
        **OrderConfirmed**

        Contains a detailed information
        about an order.
        end note
        "Message Broker" --> "Notification Service": consume
    deactivate "Message Broker"

    activate "Notification Service"
        "Notification Service" -> "Notification Service": Send an email
    deactivate "Notification Service"
end
@enduml
```
