README.md
```plantuml
@startuml
group Register a user
    User -> Gateway: POST /register/

    activate Gateway
        note right: RegistrationRequested
        Gateway -> "Message Broker": publish
    deactivate Gateway

    activate "Message Broker"
        "Message Broker" --> "User Service": consume
    deactivate "Message Broker"

    activate "User Service"
        "User Service" -> "Message Broker": publish
    deactivate "User Service"

    activate "Message Broker"
        note left: UserCreated
        "Message Broker" --> Gateway: consume
        activate Gateway
            Gateway -> User: 201 CREATED
        deactivate Gateway

        "Message Broker" --> "Notification Service": consume

        activate "Notification Service"
            "Notification Service" -> "Notification Service": Store an email
        deactivate "Notification Service"

        "Message Broker" --> "Billing Service": consume
    deactivate "Message Broker"

    activate "Billing Service"
        "Billing Service" -> "Billing Service": Create an account
        "Billing Service" -> "Message Broker": publish
        note left: AccountCreated
    deactivate "Billing Service"
end

group Charge a user account
    User -> Gateway: POST /transaction/

    activate Gateway
        note right: TransactionRequested
        Gateway -> "Message Broker": publish
    deactivate Gateway

    activate "Message Broker"
        "Message Broker" --> "Billing Service": consume
    deactivate "Message Broker"

    activate "Billing Service"
        "Billing Service" -> "Message Broker": publish
    deactivate "Billing Service"

    activate "Message Broker"
        note left: TransactionCreated
        "Message Broker" --> Gateway: consume
    deactivate "Message Broker"

    activate Gateway
        Gateway -> User: 201 CREATED
    deactivate Gateway
end

group Create an order
    User -> Gateway: POST /order/

    activate Gateway
        note right: OrderRequested
        Gateway -> "Message Broker": publish
    deactivate Gateway

    activate "Message Broker"
        "Message Broker" --> "Order Service": consume
    deactivate "Message Broker"

    activate "Order Service"
        "Order Service" -> "Order Service": Create an order
        "Order Service" -> "Message Broker": publish
    deactivate "Order Service"

    activate "Message Broker"
        note left: OrderCreated
        note left: TransactionRequested
        "Message Broker" --> "Billing Service": consume
    deactivate "Message Broker"

    activate "Billing Service"
        "Billing Service" -> "Billing Service": Debit from the account
        "Billing Service" -> "Message Broker": publish
        note left: TransactionCompleted
    deactivate "Billing Service"

    activate "Message Broker"
        "Message Broker" --> "Order Service": consume
    deactivate "Message Broker"

    activate "Order Service"
        "Order Service" -> "Order Service": Confirm an order
        "Order Service" -> "Message Broker": publish
    deactivate "Order Service"

    activate "Message Broker"
        note left: OrderConfirmed
        "Message Broker" --> Gateway: consume

        activate Gateway
            Gateway -> User: 201 CREATED
        deactivate Gateway

        "Message Broker" --> "Notification Service": consume
    deactivate "Message Broker"

    activate "Notification Service"
        "Notification Service" -> "Notification Service": Send an email
    deactivate "Notification Service"
end
@enduml
```
