doc/event-collaboration/sequence-diagram.mmd
sequenceDiagram
    participant User
    participant Gateway
    participant MessageBroker as Message Broker
    participant UserService as User Service
    participant BillingService as Billing Service
    participant OrderService as Order Service
    participant NotificationService as Notification Service

    rect rgba(0, 255, 0, .1)
        note right of User: Register a user
        User ->> Gateway: POST /register/

        activate Gateway
            note right of Gateway: RegistrationRequested
            Gateway ->> MessageBroker: publish
        deactivate Gateway

        activate MessageBroker
            MessageBroker -->> UserService: consume
        deactivate MessageBroker

        activate UserService
            UserService ->> MessageBroker: publish
        deactivate UserService

        activate MessageBroker
            note left of MessageBroker: UserCreated
            MessageBroker -->> Gateway: consume
            activate Gateway
                Gateway ->> User: 201 CREATED
            deactivate Gateway

            MessageBroker -->> NotificationService: consume

            activate NotificationService
                NotificationService ->> NotificationService: Store an email
            deactivate NotificationService

            MessageBroker -->> BillingService: consume
        deactivate MessageBroker

        activate BillingService
            BillingService ->> BillingService: Create an account
            BillingService ->> MessageBroker: publish
            note left of MessageBroker: AccountCreated
        deactivate BillingService
    end

    rect rgba(0, 255, 0, .1)
        note right of User: Charge a user account
        User ->> Gateway: POST /transaction/

        activate Gateway
            note right of Gateway: TransactionRequested
            Gateway ->> MessageBroker: publish
        deactivate Gateway

        activate MessageBroker
            MessageBroker -->> BillingService: consume
        deactivate MessageBroker

        activate BillingService
            BillingService ->> MessageBroker: publish
        deactivate BillingService

        activate MessageBroker
            note left of MessageBroker: TransactionCreated
            MessageBroker -->> Gateway: consume
        deactivate MessageBroker

        activate Gateway
            Gateway ->> User: 201 CREATED
        deactivate Gateway
    end

    rect rgba(0, 255, 0, .1)
        note right of User: Create an order
        User ->> Gateway: POST /order/

        activate Gateway
            note right of Gateway: OrderRequested
            Gateway ->> MessageBroker: publish
        deactivate Gateway

        activate MessageBroker
            MessageBroker -->> OrderService: consume
        deactivate MessageBroker

        activate OrderService
            OrderService ->> OrderService: Create an order
            OrderService ->> MessageBroker: publish

            activate MessageBroker
                note left of MessageBroker: OrderCreated
                MessageBroker -->> Gateway: consume
                activate Gateway
                    Gateway ->> User: 201 CREATED
                deactivate Gateway
            deactivate MessageBroker

            OrderService ->> MessageBroker: publish
        deactivate OrderService

        activate MessageBroker
            note left of MessageBroker: TransactionRequested
            MessageBroker -->> BillingService: consume
        deactivate MessageBroker

        activate BillingService
            BillingService ->> BillingService: Debit from the account
            BillingService ->> MessageBroker: publish

            activate MessageBroker
            note left of MessageBroker: TransactionCompleted
        deactivate BillingService

            MessageBroker -->> OrderService: consume
        deactivate MessageBroker

        activate OrderService
            OrderService ->> OrderService: Confirm an order
            OrderService ->> MessageBroker: publish
        deactivate OrderService

        activate MessageBroker
            note left of MessageBroker: OrderConfirmed
            MessageBroker -->> NotificationService: consume
        deactivate MessageBroker

        activate NotificationService
            NotificationService ->> NotificationService: Send an email
        deactivate NotificationService
    end
